import sqlite3

#**************************************************************************************
# Erstelle eine Verbindung zur SQLite-Datei
#**************************************************************************************
conn = sqlite3.connect('example.db')

#**************************************************************************************
# Erstelle einen Cursor-Objekt
#**************************************************************************************
cursor = conn.cursor()

# #**************************************************************************************
# # Erstelle eine Tabelle
# #**************************************************************************************
cursor.execute('''
    CREATE TABLE IF NOT EXISTS example_table (
        id INTEGER PRIMARY KEY,
        name TEXT,
        age INTEGER
    )
''')
conn.commit()

#**************************************************************************************
# Fülle die Tabelle mit Inhalten
#**************************************************************************************
cursor.execute("INSERT INTO example_table (name, age) VALUES ('John', 25)")
cursor.execute("INSERT INTO example_table (name, age) VALUES ('Jane', 30)")
cursor.execute("INSERT INTO example_table (name, age) VALUES ('Bob', 35)")

#**************************************************************************************
# Speichere die Änderungen
#**************************************************************************************
conn.commit()

#**************************************************************************************
# Lese die Daten aus der Tabelle
#**************************************************************************************
cursor.execute("SELECT * FROM example_table")

#**************************************************************************************
# Zeige die Ergebnisse an
#**************************************************************************************
rows = cursor.fetchall()
for row in rows:
    print(row)

# #**************************************************************************************
# Schließe die Verbindung
# #**************************************************************************************
conn.close()


# #**************************************************************************************
# Randbemerkung
# #**************************************************************************************
print("\nmit welchen Datentypen haben wir es zu tun?")
print("der Returnwert von cursor.fetchall() ist: ", type(rows))
print("ein einzelnes Element dieser List ist ein: ", type(rows[0]))
